<!-- First Text - First Page-->

<div class="row-fluid">
    <div class="span12">
        <div class="container-first-text container-first-text-full-size">

            <p>
    <span class="font-green" >
    תודה על הקניה
    <br />
    </span>

    <span class="dark">
הספר נשלח אל כתובת האימייל שלך
        <?=e($email);?>
    </span>
            </p>

        </div>
    </div>
</div>


<!-- Second Text - First Page-->

<div class="container-second-text">
    <div class="row-fluid">
        <div class="span12" dir="rtl">

            <p dir="RTL">היי,</p>

            <p dir="RTL">עכשיו כשברשותך הספר הזה תוכל להענות מהעולם המדהים של תכנות מונחה עצמים. תוכל להבין בשביל מה לך להשתמש בו ולמה מתכנתים וחברות כול כך אוהבים אותו. ולא רק זה, תלמד בצורה מורחבת מה שלא מספרים לך באף מדריך באינטרנט.</p>

            <p dir="RTL">הספר כולל הסברים פשוטים על דברים שלמתכנת ממוצע נדרש בין שלוש לחמש שנים ללמוד, מה שמבדיל מתכנת מנוסה ממתכנת בינוני ומשפיע בצורה ישירה על המשכורת שלו. הספר הזה ייקח אותך צעד אחר צעד וידאג להקפיץ אותך מעל המכשולים והטעויות שרוב המתכנתים עושים.</p>

            <p dir="RTL">עם זאת, זו הגרסה הראשונה של הספר וכבר עכשיו מתוכננים בה שינויים נוספים, כמו פרקים חדשים ועריכות לשוניות. בשביל שלא תצטרך לשלם כל פעם מחדש על הוצאות חדשות, כפי שהיית צריך לעשות אילו היית קונה את הספר בחנות, אני מבטיח לך לשלוח את העדכונים שאני אעשה לספר בעתיד ואת הפרקים החדשים שהוסיף.</p>

            <p dir="RTL">מעבר לזה, אני מבטיח לך החזר כספי מלא במהלך שישים הימים הקרובים במידה ולא תהיה מרוצה מהספר הזה מכל סיבה שהיא, בלי לשאול שאלות. שלח לי אימייל לכתובת <a href="mailto:alex@phpguide.co.il"><span dir="LTR">alex@phpguide.co.il</span></a> ואדאג להחזיר לך את כל כספך חזרה.</p>

            <p dir="RTL">עכשיו כשאתה מוכן לקפוץ רמה וסוף סוף ללמוד מה זה תכנות מונחה עצמים נשאר רק לאחל לך בהצלחה ולהזכיר שהפורום באתר <a href="http://phpguide.co.il"><span dir="LTR">phpguide.co.il</span></a> פעיל והקהילה תמיד תשמח לענות לשאלות.</p>

            <p dir="RTL">בהצלחה,</p>

            <p dir="RTL">אלכס.</p>

        </div>
    </div>
</div>
