
<div class="row">
    <div class="offset1">
      
        <h1>שלום <?=e($name)?></h1>
        זו הפעם הראשונה שאתה נכנס לאתר באמצעות חשבון ה
        <?= $provider ?>
        שלך. 
        <br/>
        אם כבר יש לך שם משתמש רשום באתר, הכנס את שם המשתמש והסיסמה בטופס התחתון.
        <br/><br/>
        אם עדיין אין לך שם משתמש וסיסמה, תבחר לעצמך שם כלשהו, שיוצג לשאר המשתמשים,
        הזן את כתובת האימייל שלך ובחר סיסמה שתשמור על החשבון שלך:
        
        <br/><br/>
        
        
        

    </div>
</div>


<? $this->renderPartial('form', array('return_location' => $return_location)) ?>